#### Terraform Network Firewall Demo 🚀

#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Validation 🤖: `success`
#### Terraform Plan 📖: `failure`

<details><summary>Show Plan</summary>

```terraform
data.aws_region.current: Reading...
module.s3_firewall_logs.data.aws_partition.current: Reading...
module.s3_firewall_logs.data.aws_caller_identity.current: Reading...
module.s3_firewall_logs.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3_athena_results.data.aws_caller_identity.current: Reading...
data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.s3_athena_results.data.aws_partition.current: Reading...
module.s3_firewall_logs.data.aws_region.current: Reading...
module.s3_firewall_logs.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.s3_athena_results.data.aws_region.current: Reading...
data.aws_caller_identity.current: Reading...
module.s3_athena_results.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.s3_athena_results.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3_firewall_logs.data.aws_caller_identity.current: Read complete after 1s [id=346381328608]
data.aws_caller_identity.current: Read complete after 1s [id=346381328608]
module.s3_athena_results.data.aws_caller_identity.current: Read complete after 1s [id=346381328608]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.aws_iam_policy_document.firewall_logs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "firewall_logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AWSNetworkFirewallLogging"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "346381328608",
                ]
              + variable = "aws:SourceAccount"
            }

          + principals {
              + identifiers = [
                  + "network-firewall.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetBucketAcl",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AWSNetworkFirewallBucketACL"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "346381328608",
                ]
              + variable = "aws:SourceAccount"
            }

          + principals {
              + identifiers = [
                  + "network-firewall.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_athena_workgroup.firewall_analysis will be created
  + resource "aws_athena_workgroup" "firewall_analysis" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "network-firewall-analysis"
      + state         = "ENABLED"
      + tags          = {
          + "Name" = "network-firewall-analysis"
        }
      + tags_all      = {
          + "Name" = "network-firewall-analysis"
        }

      + configuration {
          + enforce_workgroup_configuration    = true
          + publish_cloudwatch_metrics_enabled = true
          + requester_pays_enabled             = false

          + result_configuration {
              + output_location = (known after apply)

              + encryption_configuration {
                  + encryption_option = "SSE_S3"
                }
            }
        }
    }

  # aws_cloudwatch_log_group.network_firewall_alert will be created
  + resource "aws_cloudwatch_log_group" "network_firewall_alert" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/network-firewall/alert"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "demo"
          + "Name"        = "network-firewall-demo-alert-logs"
        }
      + tags_all          = {
          + "Environment" = "demo"
          + "Name"        = "network-firewall-demo-alert-logs"
        }
    }

  # aws_cloudwatch_log_metric_filter.allowed_domains will be created
  + resource "aws_cloudwatch_log_metric_filter" "allowed_domains" {
      + id             = (known after apply)
      + log_group_name = "/aws/network-firewall/alert"
      + name           = "NetworkFirewall-AllowedDomains"
      + pattern        = "{ $.event.alert.action = \"allowed\" }"

      + metric_transformation {
          + name      = "AllowedDomainCount"
          + namespace = "NetworkFirewall"
          + unit      = "Count"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.blocked_domains will be created
  + resource "aws_cloudwatch_log_metric_filter" "blocked_domains" {
      + id             = (known after apply)
      + log_group_name = "/aws/network-firewall/alert"
      + name           = "NetworkFirewall-BlockedDomains"
      + pattern        = "{ $.event.alert.action = \"blocked\" }"

      + metric_transformation {
          + name      = "BlockedDomainCount"
          + namespace = "NetworkFirewall"
          + unit      = "Count"
          + value     = "1"
        }
    }

  # aws_eip.nat will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "nfw-demo-nat-eip"
        }
      + tags_all             = {
          + "Name" = "nfw-demo-nat-eip"
        }
      + vpc                  = (known after apply)
    }

  # aws_glue_catalog_database.firewall_logs will be created
  + resource "aws_glue_catalog_database" "firewall_logs" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + description  = "Database for Network Firewall logs analysis"
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "network_firewall_logs"
      + tags_all     = (known after apply)
    }

  # aws_iam_instance_profile.ssm_profile will be created
  + resource "aws_iam_instance_profile" "ssm_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "nfw-demo-ec2-ssm-profile-346381328608-ap-northeast-1"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "nfw-demo-ec2-ssm-role-346381328608-ap-northeast-1"
      + tags        = {
          + "Name" = "nfw-demo-ec2-ssm-profile"
        }
      + tags_all    = {
          + "Name" = "nfw-demo-ec2-ssm-profile"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_role.ssm_role will be created
  + resource "aws_iam_role" "ssm_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "nfw-demo-ec2-ssm-role-346381328608-ap-northeast-1"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "nfw-demo-ec2-ssm-role"
        }
      + tags_all              = {
          + "Name" = "nfw-demo-ec2-ssm-role"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.ssm_core will be created
  + resource "aws_iam_role_policy_attachment" "ssm_core" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "nfw-demo-ec2-ssm-role-346381328608-ap-northeast-1"
    }

  # aws_instance.test will be created
  + resource "aws_instance" "test" {
      + ami                                  = "ami-0091f05e4b8ee6709"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = false
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "nfw-demo-ec2-ssm-profile-346381328608-ap-northeast-1"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = true
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Environment" = "demo"
          + "Name"        = "firewall-test-ec2"
        }
      + tags_all                             = {
          + "Environment" = "demo"
          + "Name"        = "firewall-test-ec2"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = "enabled"
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 8
          + volume_type           = "gp3"
        }
    }

  # aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "nfw-demo-igw"
        }
      + tags_all = {
          + "Name" = "nfw-demo-igw"
        }
      + vpc_id   = (known after apply)
    }

  # aws_nat_gateway.main will be created
  + resource "aws_nat_gateway" "main" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "nfw-demo-nat"
        }
      + tags_all                           = {
          + "Name" = "nfw-demo-nat"
        }
    }

  # aws_networkfirewall_firewall.main will be created
  + resource "aws_networkfirewall_firewall" "main" {
      + arn                 = (known after apply)
      + delete_protection   = false
      + firewall_policy_arn = (known after apply)
      + firewall_status     = (known after apply)
      + id                  = (known after apply)
      + name                = "vpc-firewall"
      + tags                = {
          + "Name" = "nfw-demo"
        }
      + tags_all            = {
          + "Name" = "nfw-demo"
        }
      + update_token        = (known after apply)
      + vpc_id              = (known after apply)

      + subnet_mapping {
          + ip_address_type = (known after apply)
          + subnet_id       = (known after apply)
        }
    }

  # aws_networkfirewall_firewall_policy.main will be created
  + resource "aws_networkfirewall_firewall_policy" "main" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + name         = "firewall-policy"
      + tags         = {
          + "Name" = "firewall-policy"
        }
      + tags_all     = {
          + "Name" = "firewall-policy"
        }
      + update_token = (known after apply)

      + firewall_policy {
          + stateless_default_actions          = [
              + "aws:forward_to_sfe",
            ]
          + stateless_fragment_default_actions = [
              + "aws:forward_to_sfe",
            ]

          + stateful_engine_options {
              + rule_order = "DEFAULT_ACTION_ORDER"
            }

          + stateful_rule_group_reference {
              + resource_arn = (known after apply)
            }
          + stateful_rule_group_reference {
              + resource_arn = (known after apply)
            }
        }
    }

  # aws_networkfirewall_logging_configuration.main will be created
  + resource "aws_networkfirewall_logging_configuration" "main" {
      + firewall_arn = (known after apply)
      + id           = (known after apply)

      + logging_configuration {
          + log_destination_config {
              + log_destination      = (known after apply)
              + log_destination_type = "S3"
              + log_type             = "FLOW"
            }
          + log_destination_config {
              + log_destination      = {
                  + "logGroup" = "/aws/network-firewall/alert"
                }
              + log_destination_type = "CloudWatchLogs"
              + log_type             = "ALERT"
            }
        }
    }

  # aws_networkfirewall_rule_group.allowlist will be created
  + resource "aws_networkfirewall_rule_group" "allowlist" {
      + arn          = (known after apply)
      + capacity     = 100
      + id           = (known after apply)
      + name         = "allowlist-domain-rules"
      + tags         = {
          + "Name" = "allowlist-domain-rules"
        }
      + tags_all     = {
          + "Name" = "allowlist-domain-rules"
        }
      + type         = "STATEFUL"
      + update_token = (known after apply)

      + rule_group {
          + rules_source {
              + rules_source_list {
                  + generated_rules_type = "ALLOWLIST"
                  + target_types         = [
                      + "HTTP_HOST",
                      + "TLS_SNI",
                    ]
                  + targets              = [
                      + ".amazon.com",
                      + ".amazonaws.com",
                      + ".example.com",
                    ]
                }
            }
        }
    }

  # aws_networkfirewall_rule_group.denylist will be created
  + resource "aws_networkfirewall_rule_group" "denylist" {
      + arn          = (known after apply)
      + capacity     = 100
      + id           = (known after apply)
      + name         = "denylist-domain-rules"
      + tags         = {
          + "Name" = "denylist-domain-rules"
        }
      + tags_all     = {
          + "Name" = "denylist-domain-rules"
        }
      + type         = "STATEFUL"
      + update_token = (known after apply)

      + rule_group {
          + rules_source {
              + rules_source_list {
                  + generated_rules_type = "DENYLIST"
                  + target_types         = [
                      + "HTTP_HOST",
                      + "TLS_SNI",
                    ]
                  + targets              = [
                      + ".google.com",
                    ]
                }
            }
        }
    }

  # aws_route.firewall_to_nat will be created
  + resource "aws_route" "firewall_to_nat" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.public_to_igw will be created
  + resource "aws_route" "public_to_igw" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.firewall will be created
  + resource "aws_route_table" "firewall" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "firewall-rtb"
        }
      + tags_all         = {
          + "Name" = "firewall-rtb"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.igw will be created
  + resource "aws_route_table" "igw" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "igw-rtb"
        }
      + tags_all         = {
          + "Name" = "igw-rtb"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "private-rtb"
        }
      + tags_all         = {
          + "Name" = "private-rtb"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "public-rtb"
        }
      + tags_all         = {
          + "Name" = "public-rtb"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.firewall will be created
  + resource "aws_route_table_association" "firewall" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_s3_bucket_policy.firewall_logs will be created
  + resource "aws_s3_bucket_policy" "firewall_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_subnet.firewall will be created
  + resource "aws_subnet" "firewall" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "AZ"   = "ap-northeast-1a"
          + "Name" = "network-firewall-demo-firewall-subnet"
        }
      + tags_all                                       = {
          + "AZ"   = "ap-northeast-1a"
          + "Name" = "network-firewall-demo-firewall-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "AZ"   = "ap-northeast-1a"
          + "Name" = "network-firewall-demo-private-subnet"
        }
      + tags_all                                       = {
          + "AZ"   = "ap-northeast-1a"
          + "Name" = "network-firewall-demo-private-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "AZ"   = "ap-northeast-1a"
          + "Name" = "network-firewall-demo-public-subnet"
        }
      + tags_all                                       = {
          + "AZ"   = "ap-northeast-1a"
          + "Name" = "network-firewall-demo-public-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/22"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "network-firewall-demo-vpc"
        }
      + tags_all                             = {
          + "Name" = "network-firewall-demo-vpc"
        }
    }

  # aws_vpc_endpoint.ssm["ec2messages"] will be created
  + resource "aws_vpc_endpoint" "ssm" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.ec2messages"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Description" = "EC2 Messages endpoint for SSM Agent"
          + "Environment" = "demo"
          + "Name"        = "nfw-demo-ec2messages-endpoint"
        }
      + tags_all              = {
          + "Description" = "EC2 Messages endpoint for SSM Agent"
          + "Environment" = "demo"
          + "Name"        = "nfw-demo-ec2messages-endpoint"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)
    }

  # aws_vpc_endpoint.ssm["ssm"] will be created
  + resource "aws_vpc_endpoint" "ssm" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.ssm"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Description" = "SSM endpoint for Session Manager"
          + "Environment" = "demo"
          + "Name"        = "nfw-demo-ssm-endpoint"
        }
      + tags_all              = {
          + "Description" = "SSM endpoint for Session Manager"
          + "Environment" = "demo"
          + "Name"        = "nfw-demo-ssm-endpoint"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)
    }

  # aws_vpc_endpoint.ssm["ssmmessages"] will be created
  + resource "aws_vpc_endpoint" "ssm" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.ssmmessages"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Description" = "SSM Messages endpoint for Session Manager"
          + "Environment" = "demo"
          + "Name"        = "nfw-demo-ssmmessages-endpoint"
        }
      + tags_all              = {
          + "Description" = "SSM Messages endpoint for Session Manager"
          + "Environment" = "demo"
          + "Name"        = "nfw-demo-ssmmessages-endpoint"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)
    }

  # module.ec2_security_group.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security group for EC2 instance - Network Firewall demo"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "nfw-demo-ec2-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "demo"
          + "Name"        = "ec2-sg"
        }
      + tags_all               = {
          + "Environment" = "demo"
          + "Name"        = "ec2-sg"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.ec2_security_group.aws_security_group_rule.egress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "egress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all outbound (filtered by Network Firewall)"
      + from_port                = -1
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.ec2_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "10.0.0.0/22",
        ]
      + description              = "Allow HTTPS from VPC for SSM"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.s3_athena_results.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "athena-results-346381328608-ap-northeast-1"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "demo"
          + "Name"        = "athena-query-results"
          + "Purpose"     = "athena-query-results"
        }
      + tags_all                    = {
          + "Environment" = "demo"
          + "Name"        = "athena-query-results"
          + "Purpose"     = "athena-query-results"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3_athena_results.aws_s3_bucket_lifecycle_configuration.this[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "this" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "query-results-expiration"
          + status = "Enabled"

          + expiration {
              + days                         = 30
              + expired_object_delete_marker = false
            }

          + filter {
            }
        }
    }

  # module.s3_athena_results.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_athena_results.aws_s3_bucket_server_side_encryption_configuration.this[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.s3_firewall_logs.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "nfw-logs-346381328608-ap-northeast-1"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "demo"
          + "Name"        = "network-firewall-demo-logs"
          + "Purpose"     = "network-firewall-logging"
        }
      + tags_all                    = {
          + "Environment" = "demo"
          + "Name"        = "network-firewall-demo-logs"
          + "Purpose"     = "network-firewall-logging"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3_firewall_logs.aws_s3_bucket_lifecycle_configuration.this[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "this" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "log-expiration"
          + status = "Enabled"

          + expiration {
              + days                         = 90
              + expired_object_delete_marker = false
            }

          + filter {
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 30
            }
        }
    }

  # module.s3_firewall_logs.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_firewall_logs.aws_s3_bucket_server_side_encryption_configuration.this[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.s3_firewall_logs.aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.vpc_endpoint_security_group.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security group for VPC endpoints (SSM, EC2messages, SSMmessages)"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "vpc-endpoint-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "demo"
          + "Name"        = "vpc-endpoint-sg"
        }
      + tags_all               = {
          + "Environment" = "demo"
          + "Name"        = "vpc-endpoint-sg"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.vpc_endpoint_security_group.aws_security_group_rule.egress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "egress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all outbound traffic"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.vpc_endpoint_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "10.0.0.0/22",
        ]
      + description              = "Allow HTTPS from VPC for VPC endpoints"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

Plan: 49 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + athena_database       = "network_firewall_logs"
  + athena_ddl_flow       = (known after apply)
  + athena_sample_queries = <<-EOT
        注意: ALERTログはCloudWatch Logsに保存されています。
        ALERTログの分析はCloudWatch Logs Insightsを使用してください。
        S3に保存されているのはFLOWログのみです。
        
        -- ========================================
        -- 1. トラフィックフロー(FLOW)の統計 - 特定日のみ
        -- ========================================
        -- FLOWログは大量のため、パーティションフィルタが必須
        -- WHERE句にパーティションカラム(year, month, day)を含めることで高速化
        
        SELECT
          event.dest_ip,
          event.dest_port,
          event.proto,
          COUNT(*) as connection_count,
          SUM(event.netflow.bytes) as total_bytes,
          SUM(event.netflow.pkts) as total_packets
        FROM network_firewall_logs.flow_logs
        WHERE year = '2025'
          AND month = '01'
          AND day = '15'
        GROUP BY event.dest_ip, event.dest_port, event.proto
        ORDER BY total_bytes DESC
        LIMIT 20;
        
        -- ========================================
        -- 2. 時間帯別トラフィック分析（週単位）
        -- ========================================
        -- パーティションフィルタで週単位のデータのみ集計
        
        SELECT
          date_trunc('hour', from_unixtime(event_timestamp)) as hour,
          COUNT(*) as flow_count,
          SUM(event.netflow.bytes) as total_bytes
        FROM network_firewall_logs.flow_logs
        WHERE year = '2025'
          AND month = '01'
          AND day BETWEEN '15' AND '21'
        GROUP BY date_trunc('hour', from_unixtime(event_timestamp))
        ORDER BY hour DESC;
        
        -- ========================================
        -- 3. パーティション別のログ件数確認
        -- ========================================
        -- 各パーティションにどれだけのログがあるかを確認
        
        SELECT
          year,
          month,
          day,
          hour,
          COUNT(*) as log_count
        FROM network_firewall_logs.flow_logs
        WHERE year = '2025'
          AND month = '01'
        GROUP BY year, month, day, hour
        ORDER BY year, month, day, hour;
        
        -- ========================================
        -- パーティションフィルタ利用のベストプラクティス:
        -- ========================================
        -- 1. 常にWHERE句にyear, month, dayを含める
        -- 2. 範囲指定時は BETWEEN を使用
        -- 3. 全期間スキャンが必要な場合は集計範囲を限定
        -- 4. クエリ実行前に「Data scanned」を確認
        
        -- ========================================
        -- CloudWatch Logs Insightsでのアラート分析例:
        -- ========================================
        -- ロググループ: /aws/network-firewall/alert
        --
        -- fields @timestamp, event.src_ip, event.dest_ip, event.alert.signature, event.alert.action
        -- | filter event.alert.action = "blocked"
        -- | sort @timestamp desc
        -- | limit 100
    EOT
  + athena_workgroup      = "network-firewall-analysis"
  + ec2_instance_id       = (known after apply)
  + firewall_endpoint_id  = (known after apply)
  + s3_log_bucket         = (known after apply)
  + test_commands         = (known after apply)

```

</details>

*Pushed by: @hirokiokumura, Action: `pull_request`*